# GetHashCode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGuidKey..::..GetHashCode Method
IFCGuidKey Class See Also
---
Returns the hash code for this IFCGuidKey
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public override int GetHashCode()
```

Visual Basic
---
```text
Public Overrides Function GetHashCode As Integer
```

Visual C++
---
```text
public:
virtual int GetHashCode() override
```

# ### Return Value
A 32-bit signed integer hash code.
# See Also
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace